esp-rs/esp-pacs/esp32c2/svd/esp32c2.base.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <description>UART (Universal Asynchronous Receiver-Transmitter) Controller 1</description>
      <baseAddress>0x60010000</baseAddress>
      <interrupt>
        <name>UART1</name>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>XTS_AES</name>
      <description>XTS-AES-128 Flash Encryption</description>
      <groupName>XTS_AES</groupName>
      <baseAddress>0x600CC000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PLAIN_MEM[%s]</name>
          <description>The memory that stores plaintext</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LINESIZE</name>
          <description>XTS-AES line-size register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LINESIZE</name>
              <description>This bit stores the line size parameter. 0: 16Byte, 1: 32Byte.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESTINATION</name>
          <description>XTS-AES destination register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DESTINATION</name>
              <description>This bit stores the destination. 0: flash(default). 1: reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHYSICAL_ADDRESS</name>
          <description>XTS-AES physical address register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PHYSICAL_ADDRESS</name>
              <description>Those bits stores the physical address. If linesize is 16-byte, the physical address should be aligned of 16 bytes. If linesize is 32-byte, the physical address should be aligned of 32 bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGGER</name>
          <description>XTS-AES trigger register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGGER</name>
              <description>Set this bit to start manual encryption calculation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RELEASE</name>
          <description>XTS-AES release register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RELEASE</name>
              <description>Set this bit to release the manual encrypted result, after that the result will be visible to spi</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESTROY</name>
          <description>XTS-AES destroy register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DESTROY</name>
              <description>Set this bit to destroy XTS-AES result.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>XTS-AES status register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>Those bits shows XTS-AES status. 0=IDLE, 1=WORK, 2=RELEASE, 3=USE. IDLE means that XTS-AES is idle. WORK means that XTS-AES is busy with calculation. RELEASE means the encrypted result is generated but not visible to mspi. USE means that the encrypted result is visible to mspi.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>XTS-AES version control register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x20200623</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Those bits stores the version information of XTS-AES.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>